Repository: igormori/restaurant-management-backend
Catalog: RestaurantManagement.Api/Localization/SharedResource.*.resx
Languages: pt

# OrganizationCreated
source: Organization was created successfully.
pt: Organização criada com sucesso.

# ValidationFailed
source: Validation failed. Please check the input fields.
pt: Falha na validação. Verifique os campos informados.

# TrialExpired
source: Your trial period has expired. Please upgrade your plan.
pt: Seu período de teste expirou. Por favor, atualize seu plano.

# MaxLocationsTrial
source: Trial plan allows only 1 location.
pt: O plano de teste permite apenas 1 local.

# RequiredAttribute_ValidationError
source: The {0} field is required.
pt: O campo {0} é obrigatório.

# MaxLengthAttribute_ValidationError
source: The field {0} must be a maximum of {1} characters.
pt: O campo {0} deve ter no máximo {1} caracteres.

# MinLengthAttribute_ValidationError
source: The field {0} must be at least {1} characters.
pt: O campo {0} deve ter pelo menos {1} caracteres.

# EmailAddressAttribute_ValidationError
source: The {0} field is not a valid email address.
pt: O campo {0} não é um endereço de email válido.

# PasswordComplexity_ValidationError
source: Password must contain at least one uppercase letter, one number, and one special character.
pt: A senha deve conter pelo menos uma letra maiúscula, um número e um caractere especial.

# EmailAlreadyRegistered
source: Email is already registered.
pt: E-mail já cadastrado.

source: User not found!.
pt: Usuário não encontrado..

# UnauthorizedMessage
source: Unautorized user.
pt: Usuàrio não autorizado!

source: Invalid token.
pt: Token Invalido.

# TrialOrganizationsCannotCreateNew
source: Organizations under a trial plan cannot create additional organizations. Please upgrade your plan to add more.
pt: Organizações em período de teste não podem criar novas organizações. Atualize seu plano para adicionar mais.

# InvalidPassword
source: Invalid password. Please check your credentials.
pt: Senha inválida. Verifique suas credenciais.

# UserNotVerified
source: Your account is not verified. Please verify your email before signing in.
pt: Sua conta não está verificada. Verifique seu e-mail antes de entrar.

# AccountLocked
source: Your account has been locked due to multiple failed login attempts.
pt: Sua conta foi bloqueada devido a várias tentativas de login malsucedidas.

# AccountLockedUntil
source: Your account is locked until {0}. Please try again later.
pt: Sua conta está bloqueada até {0}. Tente novamente mais tarde.

# InvalidOrExpiredToken
source: The token is invalid or has expired. Please log in again.
pt: O token é inválido ou expirou. Faça login novamente.

# InvalidRefreshToken
source: The refresh token is invalid or expired. Please request a new login session.
pt: O token de atualização é inválido ou expirou. Solicite uma nova sessão de login.

# UserVerified
source: Your account has been verified successfully.
pt: Sua conta foi verificada com sucesso.

# InvalidOrExpiredCode
source: The verification code is invalid or has expired.
pt: O código de verificação é inválido ou expirou.

# VerificationCodeResent
source: A new verification code has been sent to your email.
pt: Um novo código de verificação foi enviado para o seu e-mail.

# UserAlreadyVerified
source: Your account is already verified.
pt: Sua conta já foi verificada.

# VerificationCodeRecentlySent
source: A verification code was sent recently. Please wait a moment before requesting another.
pt: Um código de verificação foi enviado recentemente. Aguarde um momento antes de solicitar outro.

# AccessDenied
source: You do not have permission to access this resource. Please contact your administrator if you believe this is an error.
pt: Você não tem permissão para acessar este recurso. Entre em contato com o administrador se acreditar que isso é um erro.

source: Organization not found.
pt: Organização não encontrada.

source: Organization settings not found.
pt: Configurações da organização não encontradas.
